app/views/indices/index.html.erb

    <ul>
      <% category.products.each do |product| %>
---
SELECT "products".* FROM "products" WHERE "products"."category_id" = ?  [["category_id", 1]]