app/controllers/application_controller.rb

SELECT "store_infos".* FROM "store_infos" ORDER BY "store_infos"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    def set_common_variables
      @store_info = ::StoreInfo.last