app/controllers/categories_controller.rb

    def show
      @category = ::Category.includes(:products).find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."category_id" = ?  [["category_id", 1]]