app/controllers/indices_controller.rb

    def index
      @products = Product.all
      @categories = Category.all
      @store_info = StoreInfo.last
---
SELECT "store_infos".* FROM "store_infos" ORDER BY "store_infos"."id" DESC LIMIT ?  [["LIMIT", 1]]