app/controllers/indices_controller.rb

SELECT "products".* FROM "products" WHERE (LOWER(name) LIKE LOWER('%ac%') OR LOWER(description) LIKE LOWER('%ac%'))
SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "All Categories"], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."category_id" = ?  [["category_id", 1]]
---
    def index
      @products = Product.all
      @categories = Category.all

      if params[:category].present?
        category = Category.find_by(name: params[:category])
        @products = category.products if category
        @category = category
      end

      if params[:search].present?
        @products = @products.where("LOWER(name) LIKE LOWER(:search) OR LOWER(description) LIKE LOWER(:search)", search: "%#{params[:search]}%")