app/controllers/products_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?, ?)  [["id", 1], ["id", 2], ["id", 3], ["id", 4]]
SELECT "products".* FROM "products"
---
    def index
        @products = ::Product.includes(:category).all

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ?  [["id", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @product = ::Product.includes(:category).find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def add_to_cart
        product = ::Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def remove_from_cart
        product = ::Product.find(params[:id])