app/views/layouts/application.html.erb

SELECT "categories".* FROM "categories"
---
            <select class="form-select" aria-label="Default select example" id="category" name="category">
              <option <% if  params[:category].blank? %> selected <% end %>>All Categories</option>